def cow_temp(data: float) -> str:
    """
    Выводит занчение датчика и его состояние, температуру коровы и ее состояние

    :arg
        float data: выходной сигнал датчика в диапозоне 4-20 мА

    :return
        string: показания с датчика, температуру, состояние коровы

    :raise
        TypeError неверный тип вводимых данных
        ValueError вводимые данныек отрицательные
    """

    if type(data) != float:
        raise TypeError("Невереный тип вводимых данных")

    if data < 0:
        raise ValueError("Отрицательное значение")

    if data==0:
        return f"Показания датчика = {data}мА, "+ "датчик отклоючен"

    if 3.9>=data>0 or data>=20.1:
        return f"Показания датчика = {data}мА, "+ "датчик неисправен"

    tempr = (data - 4) * (75) / (20-4)

    if 37.5 <= tempr <= 39:
        return f"Датчик исправен. Показания датчика = {data}мА , температура коровы {tempr} "+"с коровой все ок"

    if 35 <= tempr <= 37.4:
        return f"Датчик исправен. Показания датчика = {data}мА , температура коровы {tempr} "+"согрей корову"

    if 39.1 <= tempr <= 39.5:
        return f"Датчик исправен. Показания датчика = {data}мА , температура коровы {tempr} "+"охлади корову"

    if tempr <= 34.9:
        return f"Датчик исправен. Показания датчика = {data}мА , температура коровы {tempr} "+"с коровой не все ок, либо датчик свалился"

    if 39.6 <= tempr:
        return f"Датчик исправен. Показания датчика = {data}мА , температура коровы {tempr} "+"чекни корову, ей плохо"

print(cow_temp(11.1))